let text = "[ti&#58;歌谣]&#10;[ar&#58;李荣浩]&#10;[al&#58;歌谣]&#10;[by&#58;]&#10;[offset&#58;0]&#10;[00&#58;00&#46;34]歌谣&#32;&#40;Ballad&#41;&#32;&#45;&#32;李荣浩&#32;&#40;Ronghao&#32;Li&#41;&#10;[00&#58;01&#46;00]词：李荣浩&#10;[00&#58;01&#46;16]曲：李荣浩&#10;[00&#58;01&#46;33]编曲：李荣浩&#10;[00&#58;01&#46;53]制作人：李荣浩&#10;[00&#58;01&#46;76]吉他：李荣浩&#10;[00&#58;01&#46;96]贝斯：李荣浩&#10;[00&#58;02&#46;15]鼓：荒井十一&#10;[00&#58;02&#46;35]和声编写：李荣浩&#10;[00&#58;02&#46;62]和声：李荣浩&#10;[00&#58;02&#46;81]录音师：曹飞&#10;[00&#58;03&#46;01]混音师：李荣浩/曹飞&#10;[00&#58;03&#46;34]音乐制作助理：杜以丞&#10;[00&#58;03&#46;67]录音室：北京一样音乐录音室&#10;[00&#58;04&#46;10]混音室：北京一样音乐录音室&#10;[00&#58;04&#46;53]母带后期制作人：李荣浩&#10;[00&#58;04&#46;89]母带后期处理工程师：Randy&#32;Merrill&#10;[00&#58;05&#46;29]母带后期处理录音室：Sterling&#32;Sound&#32;Studio&#10;[00&#58;05&#46;72]&#10;[00&#58;44&#46;75]站台渐渐远去&#10;[00&#58;47&#46;83]刚好下起了小雨&#10;[00&#58;51&#46;06]&#10;[00&#58;52&#46;46]爸妈嘱咐几句&#10;[00&#58;55&#46;09]要好好照顾自己&#10;[00&#58;58&#46;72]&#10;[00&#58;59&#46;78]六点半的火车上&#10;[01&#58;02&#46;60]&#10;[01&#58;03&#46;55]一口没喝的豆浆&#10;[01&#58;06&#46;58]&#10;[01&#58;07&#46;28]行李箱牵挂的重量&#10;[01&#58;12&#46;24]&#10;[01&#58;14&#46;59]经过了一段段&#10;[01&#58;17&#46;48]努力打拼的日子&#10;[01&#58;20&#46;74]&#10;[01&#58;21&#46;91]跌倒过很多次&#10;[01&#58;24&#46;74]没有放弃这回事&#10;[01&#58;28&#46;62]&#10;[01&#58;29&#46;31]小时候大人爱讲&#10;[01&#58;32&#46;55]&#10;[01&#58;33&#46;06]外面的天有多大&#10;[01&#58;36&#46;76]有一天我也要去闯&#10;[01&#58;41&#46;07]&#10;[01&#58;43&#46;95]流泪和流汗我不怕&#10;[01&#58;48&#46;98]&#10;[01&#58;49&#46;77]家乡那儿的歌谣&#10;[01&#58;53&#46;57]&#10;[01&#58;54&#46;09]对我来讲是种依靠&#10;[01&#58;58&#46;09]陪伴我多少次艰难&#10;[02&#58;04&#46;97]彩虹多绚烂&#32;绚烂的多平凡&#10;[02&#58;12&#46;27]&#10;[02&#58;12&#46;83]画面里那样的好看&#10;[02&#58;19&#46;19]家乡那儿的歌谣&#10;[02&#58;23&#46;50]对我来讲是一种好&#10;[02&#58;27&#46;61]是我最顽强的一角&#10;[02&#58;34&#46;03]&#10;[02&#58;34&#46;55]每一次我感到沮丧就唱起歌谣&#10;[02&#58;41&#46;87]这样就会看到原来的模样&#10;[02&#58;47&#46;36]&#10;[03&#58;01&#46;56]经过了一段段&#10;[03&#58;04&#46;41]努力打拼的日子&#10;[03&#58;07&#46;39]&#10;[03&#58;08&#46;98]跌倒过很多次&#10;[03&#58;11&#46;79]没有放弃这回事&#10;[03&#58;15&#46;27]&#10;[03&#58;16&#46;33]小时候大人爱讲&#10;[03&#58;20&#46;04]外面的天有多大&#10;[03&#58;23&#46;06]&#10;[03&#58;23&#46;80]有一天我也要去闯&#10;[03&#58;27&#46;56]&#10;[03&#58;31&#46;04]流泪和流汗我不怕&#10;[03&#58;35&#46;43]&#10;[03&#58;36&#46;72]家乡那儿的歌谣&#10;[03&#58;40&#46;91]对我来讲是种依靠&#10;[03&#58;45&#46;12]陪伴我多少次艰难&#10;[03&#58;52&#46;04]彩虹多绚烂&#32;绚烂的多平凡&#10;[03&#58;59&#46;13]&#10;[03&#58;59&#46;96]画面里那样的好看&#10;[04&#58;06&#46;40]家乡那儿的歌谣&#10;[04&#58;10&#46;46]对我来讲是一种好&#10;[04&#58;14&#46;59]是我最顽强的一角&#10;[04&#58;21&#46;60]每一次我感到沮丧就唱起歌谣&#10;[04&#58;28&#46;99]这样就会看到原来的模样&#10;[04&#58;34&#46;77]&#10;[04&#58;36&#46;38]每一次我感到沮丧就唱起歌谣&#10;[04&#58;43&#46;73]这样就会看到原来的模样&#10;[04&#58;50&#46;99]这样就会回到我来的地方"

class LyricsPlayer {
    constructor(el) {
        this.$el = el
        this.$el.innerHTML = '<div class="player-lyrics-lines"></div>'
        this.$lines = this.$el.querySelector('.player-lyrics-lines')
        this.text = '' 
        this.index = 0
        this.lyrics = []
        this.elapsed = 0
        this.reset(this.text)
    }

    start() {
        this.intervalId = setInterval(this.update.bind(this), 1000)
    }

    pause() {
        clearInterval(this.intervalId)
    }

    render() {
        let html = this.lyrics.map(line => `
            <div class="player-lyrics-line">${line.slice(10)}</div>
        `).join('')
    this.$lines.innerHTML = html
    }

    reset(text) {
        this.pause()
        this.index = 0
        this.elapsed = 0
        
        this.$lines.style.transform = `translateY(0)`
        let $active = this.$lines.querySelector('.active')
        if ($active) {
          $active.classList.remove('active')
        }
    
        if (text) {
          this.text = this.formatText(text) || ''
          this.lyrics = this.text.match(/^\[\d{2}:\d{2}.\d{2}\](.+)$/gm) || []
          if (this.lyrics.length) this.render()
        }
    
        if (this.lyrics.length) {
          this.$lines.children[this.index].classList.add('active')
        }
      }
    

    formatText(text) {
        let div = document.createElement('div')
        div.innerHTML = text
        return div.innerText
    }
}





`
[ti:歌谣]
[ar:李荣浩]
[al:歌谣]
[by:]
[offset:0]
[00:00.34]歌谣 (Ballad) - 李荣浩 (Ronghao Li)
[00:01.00]词：李荣浩
[00:01.16]曲：李荣浩
[00:01.33]编曲：李荣浩
[00:01.53]制作人：李荣浩
[00:01.76]吉他：李荣浩
[00:01.96]贝斯：李荣浩
[00:02.15]鼓：荒井十一
[00:02.35]和声编写：李荣浩
[00:02.62]和声：李荣浩
[00:02.81]录音师：曹飞
[00:03.01]混音师：李荣浩/曹飞
[00:03.34]音乐制作助理：杜以丞
[00:03.67]录音室：北京一样音乐录音室
[00:04.10]混音室：北京一样音乐录音室
[00:04.53]母带后期制作人：李荣浩
[00:04.89]母带后期处理工程师：Randy Merrill
[00:05.29]母带后期处理录音室：Sterling Sound Studio
[00:05.72]
[00:44.75]站台渐渐远去
[00:47.83]刚好下起了小雨
[00:51.06]
[00:52.46]爸妈嘱咐几句
[00:55.09]要好好照顾自己
[00:58.72]
[00:59.78]六点半的火车上
[01:02.60]
[01:03.55]一口没喝的豆浆
[01:06.58]
[01:07.28]行李箱牵挂的重量
[01:12.24]
[01:14.59]经过了一段段
[01:17.48]努力打拼的日子
[01:20.74]
[01:21.91]跌倒过很多次
[01:24.74]没有放弃这回事
[01:28.62]
[01:29.31]小时候大人爱讲
[01:32.55]
[01:33.06]外面的天有多大
[01:36.76]有一天我也要去闯
[01:41.07]
[01:43.95]流泪和流汗我不怕
[01:48.98]
[01:49.77]家乡那儿的歌谣
[01:53.57]
[01:54.09]对我来讲是种依靠
[01:58.09]陪伴我多少次艰难
[02:04.97]彩虹多绚烂 绚烂的多平凡
[02:12.27]
[02:12.83]画面里那样的好看
[02:19.19]家乡那儿的歌谣
[02:23.50]对我来讲是一种好
[02:27.61]是我最顽强的一角
[02:34.03]
[02:34.55]每一次我感到沮丧就唱起歌谣
[02:41.87]这样就会看到原来的模样
[02:47.36]
[03:01.56]经过了一段段
[03:04.41]努力打拼的日子
[03:07.39]
[03:08.98]跌倒过很多次
[03:11.79]没有放弃这回事
[03:15.27]
[03:16.33]小时候大人爱讲
[03:20.04]外面的天有多大
[03:23.06]
[03:23.80]有一天我也要去闯
[03:27.56]
[03:31.04]流泪和流汗我不怕
[03:35.43]
[03:36.72]家乡那儿的歌谣
[03:40.91]对我来讲是种依靠
[03:45.12]陪伴我多少次艰难
[03:52.04]彩虹多绚烂 绚烂的多平凡
[03:59.13]
[03:59.96]画面里那样的好看
[04:06.40]家乡那儿的歌谣
[04:10.46]对我来讲是一种好
[04:14.59]是我最顽强的一角
[04:21.60]每一次我感到沮丧就唱起歌谣
[04:28.99]这样就会看到原来的模样
[04:34.77]
[04:36.38]每一次我感到沮丧就唱起歌谣
[04:43.73]这样就会看到原来的模样
[04:50.99]这样就会回到我来的地方`